In [1]:
import pandas as pd

In [2]:
uno = pd.read_csv("1.csv")
dos = pd.read_csv("2.csv")
tre = pd.read_csv("3.csv")
cuatro = pd.read_csv("4.csv")
cinco = pd.read_csv("5.csv")
seis = pd.read_csv("6.csv")
siete = pd.read_csv("7.csv")
ocho = pd.read_csv("8.csv")

In [27]:
uno.head()

   userId  rating   timestamp movieId
0       1     1.0  1425941529   as680
1       1     4.5  1425942435  ns2186
2       1     5.0  1425941523  hs2381
3       1     5.0  1425941546  ns3663
4       1     5.0  1425941556  as9500

In [3]:
tabla_a = pd.concat([uno, dos], axis=0)

In [4]:
tabla_b = pd.concat([tre, cuatro], axis=0)

In [5]:
tabla_c = pd.concat([cinco, seis], axis=0)

In [6]:
tabla_d = pd.concat([siete, ocho], axis=0)

In [7]:
tabla_1 = pd.concat([tabla_a, tabla_b], axis=0)

In [8]:
tabla_2 = pd.concat([tabla_c, tabla_d], axis=0)

In [9]:
tabla_u = pd.concat([tabla_1, tabla_2], axis=0)

In [35]:
tabla_u.shape

(11024289, 4)

In [36]:
tabla_u.head()

   userId  rating   timestamp movieId
0       1     1.0  1425941529   as680
1       1     4.5  1425942435  ns2186
2       1     5.0  1425941523  hs2381
3       1     5.0  1425941546  ns3663
4       1     5.0  1425941556  as9500

In [37]:
promedio_movies = tabla_u.groupby("movieId")["rating"].mean().round(1)

In [38]:
tabla_u2 = tabla_u.join(promedio_movies, on="movieId", rsuffix="_avg")

In [39]:
tabla_u2 = tabla_u.drop_duplicates(subset="movieId", keep="first")

In [40]:
tabla_u2.head()

   userId  rating   timestamp movieId
0       1     1.0  1425941529   as680
1       1     4.5  1425942435  ns2186
2       1     5.0  1425941523  hs2381
3       1     5.0  1425941546  ns3663
4       1     5.0  1425941556  as9500

In [41]:
tabla_u2.shape

(22998, 4)

In [44]:
tabla_u2 = tabla_u2.rename(columns={"rating":"score"})

In [45]:
tabla_u2.head()

   userId  score   timestamp movieId
0       1    1.0  1425941529   as680
1       1    4.5  1425942435  ns2186
2       1    5.0  1425941523  hs2381
3       1    5.0  1425941546  ns3663
4       1    5.0  1425941556  as9500

In [11]:
tabla_u2.to_csv("rating_score1.csv", index=False)